# Utils 
brew 'bash'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'fzf'
brew 'tree'
brew 'tmux'
brew 'wget'
brew 'telnet'
brew 'pre-commit'
brew 'gzip'
brew 'openssl@3'
brew 'automake'
brew 'autoconf'
brew 'findutils'
brew 'openssh'
brew 'gmp'
brew 'ansible'
brew 'glow'
brew 'jq'
brew 'loc'
brew 'ripgrep'
brew 'teamookla/speedtest/speedtest'
brew 'yt-dlp'
brew 'tree-sitter'
brew 'ipsw'
brew 'circumflex'

# Dev
brew 'neovim'
brew 'swiftformat'
brew 'swift-format'
brew 'swiftlint'
brew 'xcode-build-server'
brew 'xcodegen'
brew 'xcbeautify'
brew 'nginx'
brew 'pyenv'
brew 'virtualenv'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'docker-compose'
brew 'docker-completion'
brew 'lua'
brew 'git'
brew 'lazygit'
brew 'gh'
brew 'go'
brew 'python@3.11'
brew 'ruby'
brew 'pipx'
brew 'swiftgen'
brew 'mbedtls'
brew 'uv'
cask 'docker'
cask 'visual-studio-code'
cask 'iterm2'
cask 'ngrok'

# Apps
cask 'google-chrome'
cask 'keka'
cask 'tableplus'
cask 'knuff'
cask 'anydesk'
cask 'squidman'
cask 'postman'
cask 'nikitabobko/tap/aerospace'
cask 'firefox'
cask 'free-download-manager'
cask 'vlc'
cask 'sf-symbols'
cask 'macdroid'
cask 'openmtp'
cask 'rustdesk'
cask 'obsidian'

# Fonts
cask 'font-meslo-lg-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
